In [1]:
%load_ext sql

In [11]:
# Selecting Database
%sql sqlite:///dataset_1.db

'Connected: @dataset_1.db'

In [12]:
%sql SELECT * FROM precipitation_full LIMIT 10;

 * sqlite:///dataset_1.db
Done.

[(1, 807, 2013, 9, 1, 1, None, '[', ''),
 (1, 807, 2013, 9, 1, 25, 0, 'I', ''),
 (1, 807, 2013, 9, 30, 24, None, ']', ''),
 (1, 807, 2013, 9, 30, 25, 0, 'I', ''),
 (1, 6303, 2013, 9, 1, 1, 0, 'g', ''),
 (1, 6303, 2013, 9, 1, 25, 0, '', ''),
 (1, 6303, 2013, 9, 2, 4, 20, '', ''),
 (1, 6303, 2013, 9, 2, 5, 50, '', ''),
 (1, 6303, 2013, 9, 2, 6, 20, '', ''),
 (1, 6303, 2013, 9, 2, 7, 20, '', '')]

In [8]:
%sql select count(*) from precipitation_full;

 * sqlite:///dataset_1.db
Done.

[(74251,)]

In [15]:
%%sql
select sum(p.precipitation)
from precipitation_full p, states s;

 * sqlite:///dataset_1.db
Done.

[(59840440,)]

In [28]:
%%sql
--# Get the total rain fall for california
SELECT SUM(p.precipitation) 
FROM precipitation_full p, states s 
WHERE p.state_code = s.code AND s.abbrev = 'CA' limit 10;

 * sqlite:///dataset_1.db
Done.

[(31982,)]

In [36]:
%%sql
select * 
from precipitation_full
limit 10;

 * sqlite:///dataset_1.db
Done.

[(1, 807, 2013, 9, 1, 1, None, '[', ''),
 (1, 807, 2013, 9, 1, 25, 0, 'I', ''),
 (1, 807, 2013, 9, 30, 24, None, ']', ''),
 (1, 807, 2013, 9, 30, 25, 0, 'I', ''),
 (1, 6303, 2013, 9, 1, 1, 0, 'g', ''),
 (1, 6303, 2013, 9, 1, 25, 0, '', ''),
 (1, 6303, 2013, 9, 2, 4, 20, '', ''),
 (1, 6303, 2013, 9, 2, 5, 50, '', ''),
 (1, 6303, 2013, 9, 2, 6, 20, '', ''),
 (1, 6303, 2013, 9, 2, 7, 20, '', '')]

In [56]:
result = %sql select * from states;

 * sqlite:///dataset_1.db
Done.

In [57]:
result.keys

['code', 'name', 'abbrev']

## Creating Tables

In [1]:
%load_ext sql
%sql sqlite:///dataset_1.db

'Connected: @dataset_1.db'

In [2]:
%sql pragma table_info(precipitation_full)

 * sqlite:///dataset_1.db
Done.

[(0, 'state_code', 'INT', 0, None, 0),
 (1, 'station_id', 'INT', 0, None, 0),
 (2, 'year', 'INT', 0, None, 0),
 (3, 'month', 'INT', 0, None, 0),
 (4, 'day', 'INT', 0, None, 0),
 (5, 'hour', 'INT', 0, None, 0),
 (6, 'precipitation', 'INT', 0, None, 0),
 (7, 'flag_1', 'VARCHAR(1)', 0, None, 0),
 (8, 'flag_2', 'VARCHAR(1)', 0, None, 0)]

In [4]:
%sql select sql from sqlite_master; -- where name = 'precipitation_full'

 * sqlite:///dataset_1.db
Done.

[('CREATE TABLE precipitation_full(state_code INT, station_id INT, year INT, month INT, day INT, hour INT, precipitation INT, flag_1 VARCHAR(1), flag_2 VARCHAR(1))',),
 ('CREATE TABLE states(code INT, name VARCHAR(30), abbrev VARCHAR(2))',),
 ('CREATE TABLE precipitation(\n  station_id INT,\n  day INT,\n  precipitation INT\n)',),
 ('CREATE TABLE A(i INT, j INT, val INT)',),
 ('CREATE TABLE B(i INT, j INT, val INT)',),
 ('CREATE TABLE streets(id INT, direction CHAR(1), A text, B text, d INT, PRIMARY KEY (id, direction))',),
 (None,),
 ('CREATE TABLE franchise (name TEXT, db_type TEXT)',),
 ('CREATE TABLE store (franchise TEXT, location TEXT)',),
 ('CREATE TABLE bagel (name TEXT, price MONEY, made_by TEXT)',),
 ('CREATE TABLE purchase (bagel_name TEXT, franchise TEXT, date INT, quantity INT, purchaser_age INT)',)]

In [5]:
%%sql 
create table rain_corps_assignments(
    student_id int primary key,
    station_id int,
    state_code int,
    start_hour int,
    eng_hout int,
    holding_cup boolean,
    cup_size float,
    off_day int
)

 * sqlite:///dataset_1.db
Done.

[]

In [7]:
%sql select sql from sqlite_master;

 * sqlite:///dataset_1.db
Done.

[('CREATE TABLE precipitation_full(state_code INT, station_id INT, year INT, month INT, day INT, hour INT, precipitation INT, flag_1 VARCHAR(1), flag_2 VARCHAR(1))',),
 ('CREATE TABLE states(code INT, name VARCHAR(30), abbrev VARCHAR(2))',),
 ('CREATE TABLE precipitation(\n  station_id INT,\n  day INT,\n  precipitation INT\n)',),
 ('CREATE TABLE A(i INT, j INT, val INT)',),
 ('CREATE TABLE B(i INT, j INT, val INT)',),
 ('CREATE TABLE streets(id INT, direction CHAR(1), A text, B text, d INT, PRIMARY KEY (id, direction))',),
 (None,),
 ('CREATE TABLE franchise (name TEXT, db_type TEXT)',),
 ('CREATE TABLE store (franchise TEXT, location TEXT)',),
 ('CREATE TABLE bagel (name TEXT, price MONEY, made_by TEXT)',),
 ('CREATE TABLE purchase (bagel_name TEXT, franchise TEXT, date INT, quantity INT, purchaser_age INT)',),
 ('CREATE TABLE rain_corps_assignments(\n    student_id int primary key,\n    station_id int,\n    state_code int,\n    start_hour int,\n    eng_hout int,\n    holding_cup boolean,\n    cup_size float,\n    off_day int\n)',),
 (None,)]

### Lecture 2 pg 23

Selection - an operation of filtering a relation's tuples on some condition

Projection - is the operation of producting an output table with tuples that have a subset of their prior attributes. 

Use single quotes for constants..

#### LIKE keyword

s LIKE p : pattern matching on strings

p may contain two special symbols:

    % - any sequence of characters
    _ - any single character


#### DISTINCT keyword

Selecting Distinct elements from an attribute:

    SELECT DISTINCT Category
    FROM Product
    
#### ORDER BY

Ties are broken by the second attribute on the ORDER BY list.. idk whatthe means
Ordering is ascending unless you specify the DESC keyword:

    SELECT PName, Price, Manufacturer
    FROM Product
    where Category='gizmo' and Price > 50
    ORDER BY Price, PName

### Activity 2-2

In [13]:
%sql select sql from sqlite_master;

 * sqlite:///dataset_1.db
Done.

[('CREATE TABLE precipitation_full(state_code INT, station_id INT, year INT, month INT, day INT, hour INT, precipitation INT, flag_1 VARCHAR(1), flag_2 VARCHAR(1))',),
 ('CREATE TABLE states(code INT, name VARCHAR(30), abbrev VARCHAR(2))',),
 ('CREATE TABLE precipitation(\n  station_id INT,\n  day INT,\n  precipitation INT\n)',),
 ('CREATE TABLE A(i INT, j INT, val INT)',),
 ('CREATE TABLE B(i INT, j INT, val INT)',),
 ('CREATE TABLE streets(id INT, direction CHAR(1), A text, B text, d INT, PRIMARY KEY (id, direction))',),
 (None,),
 ('CREATE TABLE franchise (name TEXT, db_type TEXT)',),
 ('CREATE TABLE store (franchise TEXT, location TEXT)',),
 ('CREATE TABLE bagel (name TEXT, price MONEY, made_by TEXT)',),
 ('CREATE TABLE purchase (bagel_name TEXT, franchise TEXT, date INT, quantity INT, purchaser_age INT)',),
 ('CREATE TABLE rain_corps_assignments(\n    student_id int primary key,\n    station_id int,\n    state_code int,\n    start_hour int,\n    eng_hout int,\n    holding_cup boolean,\n    cup_size float,\n    off_day int\n)',),
 (None,)]

In [31]:
%%sql drop table if exists product;
create table product(
    pname varchar primary key, -- name of the product
    price money, -- price of the product
    category varchar, -- category
    manufacturer varchar NOT NULL -- manufacturer
);
insert into product values('Gizmo', 19.99, 'Gadgets', 'GizmoWorks');
insert into product values('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks');
insert into product values('MultiTouch', 203.99, 'Household', 'Hitachi');
insert into product values('SingleTouch', 149.99, 'Photography', 'Canon');

 * sqlite:///dataset_1.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [32]:
%sql select * from product;

 * sqlite:///dataset_1.db
Done.

[('Gizmo', 19.99, 'Gadgets', 'GizmoWorks'),
 ('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks'),
 ('MultiTouch', 203.99, 'Household', 'Hitachi'),
 ('SingleTouch', 149.99, 'Photography', 'Canon')]

Try writing a query to get an output table of all the products with "Touch" in the name, showing just their name and price, and sorted alphabetically by manufacturer.

In [33]:
%%sql 
select pname, price from product
where pname LIKE '%touch%'
order by manufacturer;

 * sqlite:///dataset_1.db
Done.

[('SingleTouch', 149.99), ('MultiTouch', 203.99)]

Write a query that returns the distinct names of the manufactuers that make products with 'gizmo' in the name

In [41]:
%%sql
select distinct manufacturer
from product
where pname like '%Gizmo%'

 * sqlite:///dataset_1.db
Done.

[('GizmoWorks',)]

In [42]:
%sql SELECT DISTINCT category FROM product ORDER BY category;

 * sqlite:///dataset_1.db
Done.

[('Gadgets',), ('Household',), ('Photography',)]

In [43]:
%sql SELECT category FROM product ORDER BY pname;

 * sqlite:///dataset_1.db
Done.

[('Gadgets',), ('Household',), ('Gadgets',), ('Photography',)]

In [44]:
%sql SELECT DISTINCT category FROM product ORDER BY pname;

 * sqlite:///dataset_1.db
Done.

[('Gadgets',), ('Household',), ('Photography',)]

#### Lecture 2 pg 36
Initializing an empty database

In [45]:
%sql sqlite://

'Connected: @dataset_1.db'

In [47]:
%sql DROP TABLE IF EXISTS R; DROP TABLE IF EXISTS S; DROP TABLE IF EXISTS T;
%sql CREATE TABLE R (A int); CREATE TABLE S (A int); CREATE TABLE T (A int);
for i in range(1,6):
    %sql INSERT INTO R VALUES (:i)
for i in range(1,10,2):
    %sql INSERT INTO S VALUES (:i)
for i in range(1,11,3):
    %sql INSERT INTO T VALUES (:i)

 * sqlite:///dataset_1.db
Done.
Done.
Done.
 * sqlite:///dataset_1.db
Done.
Done.
Done.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.
 * sqlite:///dataset_1.db
1 rows affected.

In [48]:
%%sql
drop table if exists product; -- This needs to be dropped if exists, see why further down!
drop table if exists company;
pragma foreign_keys = ON; -- WARNING by default off in sqlite
create table company (
    cname varchar primary key, -- company name uniquely identifies the company.
    stockprice money, -- stock price is in money 
    country varchar); -- country is just a string
insert into company values ('ToyWorks', 25.0, 'USA');
insert into company values ('ToyFriends', 65.0, 'China');
insert into company values ('ToyCo', 15.0, 'China');

create table product(
       pname varchar, -- name of the product
       price money, -- price of the product
       category varchar, -- category
       manufacturer varchar, -- manufacturer
       primary key (pname, manufacturer),
       foreign key (manufacturer) references company(cname));
insert into product values('Pikachu', 19.99, 'Toy', 'ToyWorks');
insert into product values('Pikachu', 19.99, 'Toy', 'ToyFriends');
insert into product values('Pokeball', 29.99, 'Electronic', 'ToyCo');
insert into product values('Bulbasaur', 149.99, 'Toy', 'ToyFriends');
insert into product values('Charizard', 203.99, 'Toy', 'ToyCo');
insert into product values('PokeCamera', 19.99, 'Electronic', 'ToyWorks');

 * sqlite:///dataset_1.db
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### pg 36
If a key in one table is used multiple times in another table, it can be refered to as a foreign key. To declare a foreign key:
    
    create table enrolled(
        student_id char(20),
        cid char(20),
        grade char(20),
        primary key (student_id, cid),
        FOREIGN KEY (student_id) REFRENCES Students(sid)
    );
    
Foreign keys can act as constraints. If a tuple is inserted into Enrolled without a corresponding student, this insert method will fail.

If a student is deleted, the DBA can:
1. disallow delete, 
2. remove all of the courses for that student, 
3. or sql allows a thid via NULL.

### JOINS

ex. Find all products under $200 manufactured in Japan; return their names and prices:

    select  PName, Price
    from    Product, Company
    where   Manufacturer = CName
            AND Country='Japan'
            AND Price <= 200
    
    OR
    
    select PName, Price
    from Product
    JOIN Company ON Manufacturer = Cname
                   AND Country = 'Japan'
    where Price <= 200
        
where   Manufacturer = CName is the join between tables and returns all unique combinations of their tuples which meet some specified join condition.

### Tuple variable ambiguity in Multi-Table
In schema :
    
    Person(NAME, address, worksfor)
    Company(NAME, address)
    
    IN
    
    selct distinct name, address
    from Person, Company
    Where worksfor = name
    
To resolve ambiguity:

    select distinct Person.name, Person.address
    from Person, Company
    where Person.worksfor = Company.name
    
    OR
    
    select distinct p.name, p.address
    from Person p, Company c
    where p.worksfor = c.name

Scemantics of join:

    select R.A
    from R, S
    where R.a = S.b
1. Take the cross product 
    X = RxS
    - the cross products is the set of all unique tuples in A and B
2. Apply the selections/ conditions
    y = {(r,s) E X | r.A == r.B}
3. apply projection to get final output.
    Z = (y.A) for y E Y
    
EX. final all countries that manufacture some product in the 'Gadgets' category:
    
    select Country 
    from Product, Company
    where Manu

#### EX 2.3

Exercise #1:
-----------
For three tables $R,S,T$ that only have one attribute $A$:
* R = {1,2,3,4,5}
* S = {1,3,5,7,9}
* T = {1,4,7,10}
 
$R \cap (S \cup T)$:

    SELECT DISTINCT R.A
    FROM R, S, T
    WHERE R.A = S.A OR R.A = T.A;

In [51]:
%%sql
SELECT DISTINCT R.A
FROM R, S, T
WHERE R.A = S.A OR R.A = T.A;

 * sqlite:///dataset_1.db
Done.

[(1,), (3,), (4,), (5,)]

In [53]:
%sql delete from s;

 * sqlite:///dataset_1.db
5 rows affected.

[]

In [54]:
%%sql
SELECT DISTINCT R.A
FROM R, S, T
WHERE R.A = S.A OR R.A = T.A;

 * sqlite:///dataset_1.db
Done.

[]

Exercise #2
-----------
Given:

> Product (<u>pname</u>,  price, category, manufacturer)<br>
> Company (<u>cname</u>, stockPrice, country)

Find all categories of products that are made by Chinese companies

In [57]:
%%sql
select distinct p.category
from product p, company c
where p.manufacturer = c.cname and c.country = 'China'

 * sqlite:///dataset_1.db
Done.

[('Toy',), ('Electronic',)]

In [60]:
'''
SELECT DISTINCT R.A
FROM R, S, T
WHERE R.A = S.A OR R.A = T.A
'''
'''
output = {}

for r in R:
    for s in S:
        for t in T:
            if r['A'] == s['A'] or r['A'] == t['A']:
                output.add(r['A'])
return list(output)
'''

"\noutput = {}\n\nfor r in R:\n    for s in S:\n        for t in T:\n            if r['A'] == s['A'] or r['A'] == t['A']:\n                output.add(r['A'])\nreturn list(output)\n"

### Multiset Operations in SQL
Explicit Set Operators:
    
    Select R.A
    from R, S
    Where R.A=S.A
    INTERSECT
    Select R.A
    From R, T
    Where R.A=T.A
    
By defualt SQL uses set semantics so no duplicates


    Select R.A
    from R, S
    Where R.A=S.A
    UNION
    Select R.A
    From R, T
    Where R.A=T.A
    
If we want duplicates:

    Select R.A
    from R, S
    Where R.A=S.A
    UNION ALL
    Select R.A
    From R, T
    Where R.A=T.A